[
  {
    "title": "The Hobbit",
    "author": "J.R.R. Tolkien",
    "genre": "FANTASY",
    "description": "A respectable hobbit, Bilbo Baggins, gets swept into an epic quest by Gandalf the wizard and a company of thirteen dwarves to reclaim an immense treasure guarded by Smaug the Magnificent, a large and very dangerous dragon.",
    "isbn": "9780547928227",
    "thumbnail": "https://images-na.ssl-images-amazon.com/images/I/91b0C2YNSrL.jpg"
  },
  {
    "title": "To Kill a Mockingbird",
    "author": "Harper Lee",
    "genre": "FICTION",
    "description": "A gripping, heart-wrenching, and wholly remarkable tale of coming-of-age in a South poisoned by virulent prejudice, it views a world of great beauty and savage inequities through the eyes of a young girl, as her father—a crusading local lawyer—risks everything to defend a black man unjustly accused of a terrible crime.",
    "isbn": "9780060935467",
    "thumbnail": "https://images-na.ssl-images-amazon.com/images/I/81a4kCNuH+L.jpg"
  },
  {
    "title": "1984",
    "author": "George Orwell",
    "genre": "FICTION",
    "description": "A dystopian novel set in Airstrip One (formerly Great Britain), a province of the superstate Oceania in a world of perpetual war, omnipresent government surveillance, and public manipulation.",
    "isbn": "9780451524935",
    "thumbnail": "https://images-na.ssl-images-amazon.com/images/I/819js3EQwbL.jpg"
  },
  {
    "title": "Sapiens: A Brief History of Humankind",
    "author": "Yuval Noah Harari",
    "genre": "HISTORY",
    "description": "A groundbreaking narrative of humanity’s creation and evolution—a #1 international bestseller that explores the ways in which biology and history have defined us and enhanced our understanding of what it means to be 'human.'",
    "isbn": "9780062316097",
    "thumbnail": "https://images-na.ssl-images-amazon.com/images/I/713jIoMO3UL.jpg"
  },
  {
    "title": "A Brief History of Time",
    "author": "Stephen Hawking",
    "genre": "SCIENCE",
    "description": "A landmark volume in science writing by one of the great minds of our time, Stephen Hawking’s book explores such profound questions as: How did the universe begin—and what made its start possible? Does time always flow forward?",
    "isbn": "9780553380163",
    "thumbnail": "https://images-na.ssl-images-amazon.com/images/I/81vpsIs58WL.jpg"
  },
  {
    "title": "The Diary of a Young Girl",
    "author": "Anne Frank",
    "genre": "BIOGRAPHY",
    "description": "The writings from the Dutch-language diary kept by Anne Frank while she was in hiding for two years with her family during the Nazi occupation of the Netherlands.",
    "isbn": "9780553296983",
    "thumbnail": "https://images-na.ssl-images-amazon.com/images/I/81xPK5g96GL.jpg"
  },
  {
    "title": "The Lord of the Rings",
    "author": "J.R.R. Tolkien",
    "genre": "FANTASY",
    "description": "The story of the great quest undertaken by Frodo Baggins and the Fellowship of the Ring to destroy the One Ring and defeat the Dark Lord Sauron.",
    "isbn": "9780618640157",
    "thumbnail": "https://images-na.ssl-images-amazon.com/images/I/81VK13GAgPL.jpg"
  },
  {
    "title": "Pride and Prejudice",
    "author": "Jane Austen",
    "genre": "FICTION",
    "description": "A romantic novel that charts the emotional development of the protagonist Elizabeth Bennet, who learns the error of making hasty judgments and comes to appreciate the difference between the superficial and the essential.",
    "isbn": "9780141439518",
    "thumbnail": "https://images-na.ssl-images-amazon.com/images/I/71Q1tPupKjL.jpg"
  },
  {
    "title": "The Great Gatsby",
    "author": "F. Scott Fitzgerald",
    "genre": "FICTION",
    "description": "Set in the Jazz Age on Long Island, the novel depicts narrator Nick Carraway's interactions with mysterious millionaire Jay Gatsby and Gatsby's obsession to reunite with his former love, Daisy Buchanan.",
    "isbn": "9780743273565",
    "thumbnail": "https://images-na.ssl-images-amazon.com/images/I/81QuEGw8VPL.jpg"
  },
  {
    "title": "The Catcher in the Rye",
    "author": "J.D. Salinger",
    "genre": "FICTION",
    "description": "The story of Holden Caulfield, a teenage boy who has been expelled from prep school and spends a few days in New York City, grappling with alienation and angst.",
    "isbn": "9780316769488",
    "thumbnail": "https://images-na.ssl-images-amazon.com/images/I/8125BDk3l9L.jpg"
  },
  {
    "title": "The Immortal Life of Henrietta Lacks",
    "author": "Rebecca Skloot",
    "genre": "NON_FICTION",
    "description": "An account of Henrietta Lacks, an African-American woman whose cancer cells were taken without her consent in 1951 and became the first 'immortal' human cell line, known as HeLa.",
    "isbn": "9781400052189",
    "thumbnail": "https://images-na.ssl-images-amazon.com/images/I/91ySMhUjSXL.jpg"
  },
  {
    "title": "Educated: A Memoir",
    "author": "Tara Westover",
    "genre": "BIOGRAPHY",
    "description": "A memoir about a young woman who, kept out of school, leaves her survivalist family and goes on to earn a PhD from Cambridge University.",
    "isbn": "9780399590504",
    "thumbnail": "https://images-na.ssl-images-amazon.com/images/I/81nZgDk5i2L.jpg"
  },
  {
    "title": "Cosmos",
    "author": "Carl Sagan",
    "genre": "SCIENCE",
    "description": "Retraces the 14 billion years of cosmic evolution that have transformed matter into consciousness, exploring the origin of life, the human brain, spacecraft missions, the death of the Sun, and the forces that shape galaxies.",
    "isbn": "9780345539434",
    "thumbnail": "https://images-na.ssl-images-amazon.com/images/I/91KjB7d5ACL.jpg"
  },
  {
    "title": "Guns, Germs, and Steel: The Fates of Human Societies",
    "author": "Jared Diamond",
    "genre": "HISTORY",
    "description": "An argument that geographical and environmental factors shaped the modern world. Societies that had a head start in food production advanced beyond the hunter-gatherer stage to develop writing, technology, government, and organized religion.",
    "isbn": "9780393317558",
    "thumbnail": "https://images-na.ssl-images-amazon.com/images/I/81JJD1Jp5iL.jpg"
  },
  {
    "title": "Steve Jobs",
    "author": "Walter Isaacson",
    "genre": "BIOGRAPHY",
    "description": "Based on more than forty interviews with Steve Jobs conducted over two years—as well as interviews with more than a hundred family members, friends, adversaries, competitors, and colleagues—this is the acclaimed, internationally bestselling biography of the ultimate icon of inventiveness.",
    "isbn": "9781451648539",
    "thumbnail": "https://images-na.ssl-images-amazon.com/images/I/81VStYkL6-L.jpg"
  },
  {
    "title": "The Wright Brothers",
    "author": "David McCullough",
    "genre": "BIOGRAPHY",
    "description": "The dramatic story-behind-the-story about the courageous brothers who taught the world how to fly: Wilbur and Orville Wright.",
    "isbn": "9781476728742",
    "thumbnail": "https://images-na.ssl-images-amazon.com/images/I/81+jN63mGOL.jpg"
  },
  {
    "title": "Dune",
    "author": "Frank Herbert",
    "genre": "SCIENCE",
    "description": "Set on the desert planet Arrakis, Dune is the story of the boy Paul Atreides, heir to a noble family tasked with ruling an inhospitable world where the only thing of value is the 'spice' melange, a drug capable of extending life and enhancing consciousness.",
    "isbn": "9780441013593",
    "thumbnail": "https://images-na.ssl-images-amazon.com/images/I/81nq+ewtkcL.jpg"
  },
  {
    "title": "A Game of Thrones",
    "author": "George R.R. Martin",
    "genre": "FANTASY",
    "description": "The first book in A Song of Ice and Fire, a series of epic fantasy novels. It is a tale of lords and ladies, soldiers and sorcerers, assassins and bastards, who come together in a time of grim omens.",
    "isbn": "9780553386790",
    "thumbnail": "https://images-na.ssl-images-amazon.com/images/I/91dSMhdmaEL.jpg"
  },
  {
    "title": "The Man Who Mistook His Wife for a Hat and Other Clinical Tales",
    "author": "Oliver Sacks",
    "genre": "SCIENCE",
    "description": "A collection of case histories from the practice of a neurologist, exploring the bizarre and fascinating world of neurological disorders and the indomitable human spirit.",
    "isbn": "9780684853949",
    "thumbnail": "https://images-na.ssl-images-amazon.com/images/I/81D3T9hdH6L.jpg"
  },
  {
    "title": "Into the Wild",
    "author": "Jon Krakauer",
    "genre": "NON_FICTION",
    "description": "The true story of Christopher McCandless, a young man who hitchhiked to Alaska and walked alone into the wilderness north of Mt. McKinley. He had given $25,000 in savings to charity, abandoned his car and most of his possessions, burned all the cash in his wallet, and invented a new life for himself.",
    "isbn": "9780385486804",
    "thumbnail": "https://images-na.ssl-images-amazon.com/images/I/81R92StY+9L.jpg"
  }
]